Séries - Pandas

In [5]:
#3 - Calcular média e desvio padrão

import pandas as pd

In [6]:
# Criando uma lista para preencher a série

list_series = [1, 2, 3, 4, 5, 6, 7, 8, 9, 5, 3]

series = pd.Series(list_series)

In [7]:
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64

In [8]:
# Solicitando média da série através do método mean()
print('Média: ', series.mean())
# Solicitando o desvio padrão através do método std()
print('Desvio Padrão: ', series.std())

Média:  4.818181818181818
Desvio Padrão:  2.522624895547565

In [9]:
# 4 - Criar um array com 20 números aleatórios entre 1 e 5. 
import random

In [10]:
list_random = [random.randint(1,5) for i in range(20)] # utilizando List Comprehension para praticar
array_random = pd.Series(list_random)
print(array_random)
print('-'*21)

a = array_random.value_counts()

0     1
1     3
2     1
3     5
4     2
5     1
6     1
7     1
8     5
9     5
10    3
11    4
12    3
13    4
14    3
15    1
16    2
17    4
18    2
19    3
dtype: int64
---------------------

In [11]:
index = a.index.tolist()
values = a.values.tolist()

In [12]:
print(a.index.tolist())
print(a.values.tolist())

for i in range(len(index)):
  print(f'O número {index[i]} aparece {values[i]} vezes, com uma frequência de: {round((((values[i]*index[i])/array_random.sum())*100),2)} %')

[1, 3, 5, 2, 4]
[6, 5, 3, 3, 3]
O número 1 aparece 6 vezes, com uma frequência de: 11.11 %
O número 3 aparece 5 vezes, com uma frequência de: 27.78 %
O número 5 aparece 3 vezes, com uma frequência de: 27.78 %
O número 2 aparece 3 vezes, com uma frequência de: 11.11 %
O número 4 aparece 3 vezes, com uma frequência de: 22.22 %

In [13]:
# 5 - 
# Criando array aleatório
array_random = pd.Series([random.randint(1,5) for i in range(10)])
print(array_random)

0    1
1    3
2    1
3    2
4    5
5    1
6    4
7    2
8    3
9    4
dtype: int64

In [14]:
# Contando a frequência de cada elemento
freq = array_random.value_counts()
print('A Frequência dos valores é')
display(freq)
print('-'*21)

# Atribuindo os itens mais frequentes à uma variável
mode = array_random.mode()
print('Os valores mais frequentes são:')
display(mode.tolist())
print('-'*21)


# Substituindo na serie original os valores que não são os mais frequentes
array_novo = array_random.copy()
array_novo[~array_random.isin(mode)] = 'Outro valor'
print('O novo array é:')
display(array_novo)
print('-'*21)

A Frequência dos valores é

1    3
3    2
2    2
4    2
5    1
dtype: int64

---------------------
Os valores mais frequentes são:

[1]

---------------------
O novo array é:

0              1
1    Outro valor
2              1
3    Outro valor
4    Outro valor
5              1
6    Outro valor
7    Outro valor
8    Outro valor
9    Outro valor
dtype: object

---------------------

In [15]:
# 6 - 
import numpy as np
# Criando um numpy array
np_array = np.arange(0, 10, 1)
# Embaralhando com o Shuffle
random.shuffle(np_array)
print(np_array)

[3 2 7 6 8 9 0 5 4 1]

In [16]:
# Criando uma lista para armazenar o fatorial desses valores

def fatorial(n):
  if n == 0:
    return n
  k = 1
  while n >= 2:
    k *= n
    n -=1
  return k

fat = []
for i in range(len(np_array)):
  fat.append(fatorial(np_array[i]))
# Criando a série utilizando o array embaralhado como indice
serie = pd.Series(fat, index = np_array)
print(serie)

3         6
2         2
7      5040
6       720
8     40320
9    362880
0         0
5       120
4        24
1         1
dtype: int64

Lista - Pandas 1

In [17]:
# 1 - 
# Criando Dicionário para série
dict_insc = {
    'Fundamental Completo': 451,
    'Médio Completo': 627,
    'Superior Completo': 292,
    'Pós-Graduação Completa': 95
}
# Criando Série baseada no dicionário
series_inscritos = pd.Series(dict_insc)
display(series_inscritos)

Fundamental Completo      451
Médio Completo            627
Superior Completo         292
Pós-Graduação Completa     95
dtype: int64

In [18]:
# Total de inscritos
print('O total de inscritos é:',series_inscritos.sum())

O total de inscritos é: 1465

In [19]:
# Número de Inscritos que possui pelo menos superior completo
print('O número de inscritos que possui, no mínimo, superior completo:', series_inscritos[['Superior Completo','Pós-Graduação Completa']].sum())

O número de inscritos que possui, no mínimo, superior completo: 387

In [20]:
# Series - prorrogação por categoria [68, 93, 22, 0]
alt = [68, 93, 22, 0]

series_prorrog = pd.Series(data = alt, index = ['Fundamental Completo', 'Medio Completo', 'Superior Completo', 'Pós-Graduação Completa'])
display(series_prorrog)

Fundamental Completo      68
Medio Completo            93
Superior Completo         22
Pós-Graduação Completa     0
dtype: int64

In [21]:
# Número total de inscritos pós prorrogação

print('O total de inscritos é:', series_inscritos.sum()+ series_prorrog.sum())

O total de inscritos é: 1648

In [22]:
# 2 - 

alunos = ['Wilfred', 'Abbie', 'Harry', 'Julia', 'Carrie']
notas = [2, 7, 5.5, 10, 6.2]

# Criando a série dos alunos/notas
serie_notas = pd.Series(data = notas, index = alunos)
display(serie_notas)

# Retornar o número de alunos aprovados
aprovados = serie_notas >= 7 # Máscara de aprovados

print(f'Foram aprovados {serie_notas.index[aprovados].value_counts().sum()} alunos, sendo estes: {serie_notas.index[aprovados].tolist()}')

# Retornando a média da turma
print('A média da turma foi: ', serie_notas.mean())

# Retornando alunos acima da média
acima_media = serie_notas > serie_notas.mean()
print(f'O nome dos alunos acima da média: {serie_notas.index[acima_media].tolist()}')

Wilfred     2.0
Abbie       7.0
Harry       5.5
Julia      10.0
Carrie      6.2
dtype: float64

Foram aprovados 2 alunos, sendo estes: ['Abbie', 'Julia']
A média da turma foi:  6.14
O nome dos alunos acima da média: ['Abbie', 'Julia', 'Carrie']

In [23]:
# 3 - venha de DataFrame papai

df_imc = pd.DataFrame(
    data = [
        [72, 180, 31], # pode desenhar assim, mas da pra fazer por dictionary tbm
        [80, 170, 21],
        [60, 175, 16],
        [90, 174, 28],
        [100, 185 , 23]],
        columns = ['Peso', 'Altura', 'Idade'] # há como nomear os index tbm, por padrão ele só conta
)
display(df_imc)

   Peso  Altura  Idade
0    72     180     31
1    80     170     21
2    60     175     16
3    90     174     28
4   100     185     23

In [24]:
# Visualizando os dados com a altura 
display(df_imc[['Altura']])
print('-'*21)

# Obtendo a média da idade das pessoas
print('Média da idade das pessoas:', df_imc[['Idade']].mean())
print('-'*21)

# Obtendo dados das pessoas abaixo da média de altura
media_altura = df_imc[['Altura']] < df_imc[['Altura']].mean() # Criando máscara

# Definindo a Coluna [['Altura']] -> Passando a máscara [media_altura] -> removendo NaN vindos após passar
# a máscara .dropna()
display(df_imc[['Altura']][media_altura].dropna())
print('-'*21)

# Criando uma nova coluna chamada IMC
df_imc['IMC'] = round(df_imc['Peso'] / (df_imc['Altura']/100)**2, 2)

display(df_imc)
print('-'*21)

# Removendo a coluna com a idade
df_imc_alt = df_imc.drop(columns=['Idade'])
display(df_imc_alt)
print('-'*21)

# Salvando num csv

df_imc_alt.to_csv('imc.csv')

   Altura
0     180
1     170
2     175
3     174
4     185

---------------------
Média da idade das pessoas: Idade    23.8
dtype: float64
---------------------

   Altura
1   170.0
2   175.0
3   174.0

---------------------

   Peso  Altura  Idade    IMC
0    72     180     31  22.22
1    80     170     21  27.68
2    60     175     16  19.59
3    90     174     28  29.73
4   100     185     23  29.22

---------------------

   Peso  Altura    IMC
0    72     180  22.22
1    80     170  27.68
2    60     175  19.59
3    90     174  29.73
4   100     185  29.22

---------------------

In [25]:
# 4 -
nomes = ['Kaio', 'Mila', 'Lorenna', 'Luis', 'Renato']
df_imc = pd.read_csv('./imc.csv').drop(columns = ['Unnamed: 0'])

display(df_imc)
print('-'*23)

   Peso  Altura    IMC
0    72     180  22.22
1    80     170  27.68
2    60     175  19.59
3    90     174  29.73
4   100     185  29.22

-----------------------

In [26]:
# Renomeando as linhas
df_imc['Nome'] = nomes

df_alt = df_imc.set_index('Nome')

display(df_alt)

         Peso  Altura    IMC
Nome
Kaio       72     180  22.22
Mila       80     170  27.68
Lorenna    60     175  19.59
Luis       90     174  29.73
Renato    100     185  29.22

In [27]:
# Criando máscara para sobrepeso
sobrepeso = (df_alt['IMC'] > 25) & (df_alt['IMC'] < 29.9)

print('As pessoas que se encaixam em "sobrepeso" são: ', df_alt[['IMC']][sobrepeso].index.tolist())

As pessoas que se encaixam em "sobrepeso" são:  ['Mila', 'Luis', 'Renato']

In [28]:
# 5 -

df_imc = pd.read_csv('./imc.csv').drop(columns = ['Unnamed: 0'])

In [29]:
# Adicionando a coluna e preenchendo com nada
# df_imc['Classificação'] = None -> Deprecated

# Criando e Mapeando a coluna utilizando o iterrows
for idx, rows in df_imc.iterrows():
  if rows['IMC'] < 18.5:
    df_imc.loc[idx, 'Classificação'] = 'Magreza'
  elif rows['IMC'] > 18.5 and rows['IMC'] < 24.9:
    df_imc.loc[idx, 'Classificação'] = 'Normal'
  elif rows['IMC'] > 25.0 and rows['IMC'] < 29.9:
    df_imc.loc[idx, 'Classificação'] = 'Sobrepeso'
  elif rows['IMC'] > 30.0 and rows['IMC'] < 39.9:
    df_imc.loc[idx, 'Classificação'] = 'Obesidade'
  elif rows['IMC'] > 40.0:
    df_imc.loc[idx, 'Classificação'] = 'Obesidade Grave'

display(df_imc)

   Peso  Altura    IMC Classificação
0    72     180  22.22        Normal
1    80     170  27.68     Sobrepeso
2    60     175  19.59        Normal
3    90     174  29.73     Sobrepeso
4   100     185  29.22     Sobrepeso

In [ ]:
# Exportando pra xlsx

df_imc.to_excel('./df_imc_mod.xlsx')

Lista - Pandas 2

Questão 1 - O arquivo avocado.csv consiste em um dataset que contém dados sobre vendas de abacates (avocado, em inglês) em diversas regiões dos Estados Unidos. Essa dataset contém as seguintes colunas:

 - Date - a data da observação
 - AveragePrice - o preço médio de um único abacate
 - year - o ano
 - region - a cidade ou região da observação
 - Total Volume - volume total de abacates vendidos

Além das informações acima, contidas no arquivo avocado.csv, o tipo do abacate (convencional ou orgânico) também seria uma informação importante para a sua análise. Suponhamos que você conseguiu essas informações para cada uma das observações do arquivo avocado.csv, na mesma ordem, e salvou-as no arquivo avocado_type.csv. Portanto, tudo o que você precisa é juntar esses dois arquivos em um mesmo DataFrame. E, em seguida, salve-o em um arquivo csv.

In [36]:
# Lendo arquivos de abacates

df_avocado = pd.read_csv('./datasets/avocado.csv')
df_avocado_type = pd.read_csv('./datasets/avocado_type.csv')

In [33]:
# Verificando dados
df_avocado.head()

         Date  AveragePrice  Total Volume  year  region
0  2015-12-27          1.33      64236.62  2015  Albany
1  2015-12-20          1.35      54876.98  2015  Albany
2  2015-12-13          0.93     118220.22  2015  Albany
3  2015-12-06          1.08      78992.15  2015  Albany
4  2015-11-29          1.28      51039.60  2015  Albany

In [37]:
df_avocado_type.head()

           type
0  conventional
1  conventional
2  conventional
3  conventional
4  conventional

In [38]:
# Criando um dataframe (desnecessário, mas o ideal seria não modificar o original) a partir do dataframe original
avocado_type = df_avocado

In [39]:
# Criando uma coluna nova e adicionando a série vinda dos valores do dataset de tipos
avocado_type['type'] = df_avocado_type.values

In [40]:
# Verificando as colunas
avocado_type.head()

         Date  AveragePrice  Total Volume  year  region          type
0  2015-12-27          1.33      64236.62  2015  Albany  conventional
1  2015-12-20          1.35      54876.98  2015  Albany  conventional
2  2015-12-13          0.93     118220.22  2015  Albany  conventional
3  2015-12-06          1.08      78992.15  2015  Albany  conventional
4  2015-11-29          1.28      51039.60  2015  Albany  conventional

In [42]:
# Por fim, salvando em csv
avocado_type.to_csv('./datasets/avocado_type.csv')

In [43]:
# Randomizando o tipo através de uma série
tipos = pd.Series(np.random.randint(0, 2, df_avocado.shape[0]))
tipos = tipos.map({0: 'convencional', 1:'orgânico'})

In [44]:
tipos.head()

0        orgânico
1        orgânico
2        orgânico
3    convencional
4        orgânico
dtype: object

In [45]:
# Atribuindo a série criada à coluna de tipos
avocado_type['type'] = tipos

In [46]:
# Verificando a coluna adicionada
avocado_type.head()

         Date  AveragePrice  Total Volume  year  region          type
0  2015-12-27          1.33      64236.62  2015  Albany      orgânico
1  2015-12-20          1.35      54876.98  2015  Albany      orgânico
2  2015-12-13          0.93     118220.22  2015  Albany      orgânico
3  2015-12-06          1.08      78992.15  2015  Albany  convencional
4  2015-11-29          1.28      51039.60  2015  Albany      orgânico

In [72]:
avocado_type.to_csv('./datasets/avocado_type_random.csv', index=False)

Questão 2 - Carregue o arquivo csv que você salvou na questão anterior e, em seguida, obtenha o que é solicitado nos itens elencados abaixo:

 - (a) A quantidade de abacates do tipo convecional e do tipo orgânico.
 - (b) A quantidade de registros (linhas) de abacates vendidos para cada região.
 - (c) Para que todos os labels das colunas fiquem padronizados, renomeie aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula.
 - (d) Uma vez que você já possui uma coluna com a data, remova a coluna que apresenta o ano.

In [76]:
df_avocado = pd.read_csv('./datasets/avocado_type_random.csv')

In [77]:
df_avocado.head()

         Date  AveragePrice  Total Volume  year  region          type
0  2015-12-27          1.33      64236.62  2015  Albany      orgânico
1  2015-12-20          1.35      54876.98  2015  Albany      orgânico
2  2015-12-13          0.93     118220.22  2015  Albany      orgânico
3  2015-12-06          1.08      78992.15  2015  Albany  convencional
4  2015-11-29          1.28      51039.60  2015  Albany      orgânico

In [62]:
# Retornando a quantidade de abacates do tipo convencional e do tipo orgânico
print('Dados convencionais e orgânicos')
df_avocado['type'].value_counts()

Dados convencionais e orgânicos

orgânico        9187
convencional    9062
Name: type, dtype: int64

In [63]:
# Retornando a quantidade de abacates vendidos em cada região 
df_avocado['region'].value_counts()

Albany                338
Sacramento            338
Northeast             338
NorthernNewEngland    338
Orlando               338
Name: region, dtype: int64

In [68]:
df_avocado.head()

         Date  AveragePrice  Total Volume  year  region          type
0  2015-12-27          1.33      64236.62  2015  Albany      orgânico
1  2015-12-20          1.35      54876.98  2015  Albany      orgânico
2  2015-12-13          0.93     118220.22  2015  Albany      orgânico
3  2015-12-06          1.08      78992.15  2015  Albany  convencional
4  2015-11-29          1.28      51039.60  2015  Albany      orgânico

In [69]:
# Padronizando as colunas do dataframe
# df.rename(columns={"A": "a", "B": "c"})

df_avocado.rename(columns = {
    'Date': 'date',
    'AveragePrice': 'average_price',
    'Total Volume': 'total_volume'
})

,date,average_price,total_volume,year,region,type
0,2015-12-27,1.33,64236.62,2015,Albany,orgânico
1,2015-12-20,1.35,54876.98,2015,Albany,orgânico
2,2015-12-13,0.93,118220.22,2015,Albany,orgânico
3,2015-12-06,1.08,78992.15,2015,Albany,convencional
4,2015-11-29,1.28,51039.60,2015,Albany,orgânico
...,...,...,...,...,...,...
18244,2018-02-04,1.63,17074.83,2018,WestTexNewMexico,convencional
18245,2018-01-28,1.71,13888.04,2018,WestTexNewMexico,orgânico
18246,2018-01-21,1.87,13766.76,2018,WestTexNewMexico,convencional
18247,2018-01-14,1.93,16205.22,2018,WestTexNewMexico,convencional
18248,2018-01-07,1.62,17489.58,2018,WestTexNewMexico,orgânico

In [75]:
# Dropando a coluna year
df_avocado.drop(columns = 'year')

             Date  AveragePrice  Total Volume            region          type
0      2015-12-27          1.33      64236.62            Albany      orgânico
1      2015-12-20          1.35      54876.98            Albany      orgânico
2      2015-12-13          0.93     118220.22            Albany      orgânico
3      2015-12-06          1.08      78992.15            Albany  convencional
4      2015-11-29          1.28      51039.60            Albany      orgânico
...           ...           ...           ...               ...           ...
18244  2018-02-04          1.63      17074.83  WestTexNewMexico  convencional
18245  2018-01-28          1.71      13888.04  WestTexNewMexico      orgânico
18246  2018-01-21          1.87      13766.76  WestTexNewMexico  convencional
18247  2018-01-14          1.93      16205.22  WestTexNewMexico  convencional
18248  2018-01-07          1.62      17489.58  WestTexNewMexico      orgânico

[18249 rows x 5 columns]

Questão 03 - Carregue, em um objeto DataFrame, o mesmo dataset que você salvou na questão Q1, agrupe os dados do DF pelo tipo do abacate e, em seguida, obtenha:

- (a) A volume total de abacates vendidos para cada tipo.
- (b) O preço médio dos abacates vendidos para cada tipo.

In [78]:
# Carregando dataframe
df_avocado = pd.read_csv('./datasets/avocado_type_random.csv')

In [94]:
df_avocado.head(1)

         Date  AveragePrice  Total Volume  year  region      type
0  2015-12-27          1.33      64236.62  2015  Albany  orgânico

In [88]:
# Agrupando com groupby e obtendo o volume total para cada tipo

df_avocado.groupby(['type'])['Total Volume'].sum()

type
convencional    7.636508e+09
orgânico        7.886894e+09
Name: Total Volume, dtype: float64

In [95]:
# O preço médio dos abacates vendidos pra cada tipo
df_avocado.groupby(['type'])['AveragePrice'].mean()

type
convencional    1.403339
orgânico        1.408582
Name: AveragePrice, dtype: float64

Questão 4 - O arquivo googleplaystore.csv é um dataset que contém diversas informações sobre aplicativos disponíveis para download na Google Play Store. Logo após, verifique se existem dados duplicados e/ou ausentes nesse dataset.

Caso existam dados duplicados, remova-os. Caso existam dados ausentes, você pode removê-los ou pensar em alguma maneira de preenchê-los.

In [131]:
# Carregando o dataset
df_playstore = pd.read_csv('./datasets/googleplaystore.csv')

In [132]:
# Dando uma olhada no arquivo
df_playstore.head(2)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up

In [133]:
df_playstore.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10841 entries, 0 to 10840
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   App             10841 non-null  object
 1   Category        10841 non-null  object
 2   Rating          9367 non-null   float64
 3   Reviews         10841 non-null  object
 4   Size            10841 non-null  object
 5   Installs        10841 non-null  object
 6   Type            10840 non-null  object
 7   Price           10841 non-null  object
 8   Content Rating  10840 non-null  object
 9   Genres          10841 non-null  object
 10  Last Updated    10841 non-null  object
 11  Current Ver     10833 non-null  object
 12  Android Ver     10838 non-null  object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

In [135]:
# Dropando as linhas duplicadas, mantendo a primeira por padrão
df_playstore = df_playstore.drop_duplicates()

In [136]:
df_playstore.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10358 entries, 0 to 10840
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   App             10358 non-null  object
 1   Category        10358 non-null  object
 2   Rating          8893 non-null   float64
 3   Reviews         10358 non-null  object
 4   Size            10358 non-null  object
 5   Installs        10358 non-null  object
 6   Type            10357 non-null  object
 7   Price           10358 non-null  object
 8   Content Rating  10357 non-null  object
 9   Genres          10358 non-null  object
 10  Last Updated    10358 non-null  object
 11  Current Ver     10350 non-null  object
 12  Android Ver     10355 non-null  object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

In [137]:
# Tratando infos faltando!
# Há informações faltando nas seguintes colunas: Type, Content Rating, Current Ver, Android Ver e Rating.

# Todas exceto a Rating são poucas lindas quando comparadas ao todo, sendo assim serão retiradas.
# Dropando linhas das colunas selecionadas

df_playstore = df_playstore.dropna(subset = ['Type', 'Content Rating', 'Current Ver', 'Android Ver'])

In [138]:
df_playstore.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10346 entries, 0 to 10840
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   App             10346 non-null  object
 1   Category        10346 non-null  object
 2   Rating          8886 non-null   float64
 3   Reviews         10346 non-null  object
 4   Size            10346 non-null  object
 5   Installs        10346 non-null  object
 6   Type            10346 non-null  object
 7   Price           10346 non-null  object
 8   Content Rating  10346 non-null  object
 9   Genres          10346 non-null  object
 10  Last Updated    10346 non-null  object
 11  Current Ver     10346 non-null  object
 12  Android Ver     10346 non-null  object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

In [139]:
# Tratando o Rating
# Primeiro, vamos descobrir a média desses valores. Os valores NaN não são ignorados ao fazer a média
# daí, precisamos fazer esse tratamento pra chegar no resultado de média da coluna.

df_playstore['Rating'].mean(skipna=True)

4.187958586540626

In [140]:
# Vale observar também a mediana dos valores
df_playstore['Rating'].median(skipna=True)

4.3

In [141]:
mean = df_playstore['Rating'].mean(skipna=True)

In [142]:
# Como os valores foram quase os mesmos, optei por manter a média dos valores no preenchimento dos NaN.
# Esse tratamento se deu por conta da grande quantidade de dados e por ser um métrica que pode ser inter-
# -pretada pelo todo. A chance de um usuário ter dado uma nota '4.18+' nessa massa de dados é grande.

df_playstore = df_playstore.fillna(value = mean)

In [143]:
df_playstore.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10346 entries, 0 to 10840
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   App             10346 non-null  object
 1   Category        10346 non-null  object
 2   Rating          10346 non-null  float64
 3   Reviews         10346 non-null  object
 4   Size            10346 non-null  object
 5   Installs        10346 non-null  object
 6   Type            10346 non-null  object
 7   Price           10346 non-null  object
 8   Content Rating  10346 non-null  object
 9   Genres          10346 non-null  object
 10  Last Updated    10346 non-null  object
 11  Current Ver     10346 non-null  object
 12  Android Ver     10346 non-null  object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

Questão 05 - O arquivo houses_to_rent.csv consiste em um dataset que contém dados sobre casas para alugar no Brasil. Carregue-o em um objeto DataFrame e verifique os dados contidos nas colunas desse DF (você pode utilizar os métodos head, tail e info). Logo após, verifique se existem dados duplicados e/ou ausentes nesse dataset.

Caso existam dados duplicados, remova-os. Caso existam dados ausentes, você pode removê-los ou pensar em alguma maneira de preenchê-lo

In [144]:
# Carregando o arquivo csv

df_houses = pd.read_csv('./datasets/houses_to_rent.csv')

In [146]:
# Dando uma olhada no arquivo
df_houses.head()

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
2,Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841
3,Porto Alegre,51,2,1,0,2,acept,not furnished,270,1112,22,17,1421
4,São Paulo,25,1,1,0,1,not acept,not furnished,0,800,25,11,836

In [147]:
df_houses.tail()

,city,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
10687,Porto Alegre,63,2,1,1,5,not acept,furnished,402,1478,24,22,1926
10688,São Paulo,285,4,4,4,17,acept,not furnished,3100,15000,973,191,19260
10689,Rio de Janeiro,70,3,3,0,8,not acept,furnished,980,6000,332,78,7390
10690,Rio de Janeiro,120,2,2,2,8,acept,furnished,1585,12000,279,155,14020
10691,São Paulo,80,2,1,0,-,acept,not furnished,0,1400,165,22,1587

In [148]:
df_houses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10692 entries, 0 to 10691
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   city                 10692 non-null  object
 1   area                 10692 non-null  int64
 2   rooms                10692 non-null  int64
 3   bathroom             10692 non-null  int64
 4   parking spaces       10692 non-null  int64
 5   floor                10692 non-null  object
 6   animal               10692 non-null  object
 7   furniture            10692 non-null  object
 8   hoa (R$)             10692 non-null  int64
 9   rent amount (R$)     10692 non-null  int64
 10  property tax (R$)    10692 non-null  int64
 11  fire insurance (R$)  10692 non-null  int64
 12  total (R$)           10692 non-null  int64
dtypes: int64(9), object(4)
memory usage: 1.1+ MB

In [153]:
# De acordo com o info, das 10692 entradas, nenhuma é nula.
# Verificando nulos
df_houses.isna().sum()

city                   0
area                   0
rooms                  0
bathroom               0
parking spaces         0
floor                  0
animal                 0
furniture              0
hoa (R$)               0
rent amount (R$)       0
property tax (R$)      0
fire insurance (R$)    0
total (R$)             0
dtype: int64

In [158]:
# Verificando linhas duplicadas
df_houses.duplicated().sum()

358

In [159]:
# Como só há dados duplicados, podemos aplicar a remoção
df_houses = df_houses.drop_duplicates()

In [160]:
# Verificando
df_houses.duplicated().sum()

0